tests/load-test.yml
config:
  target:
    url: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 20
      name: Sustained load
    - duration: 30
      arrivalRate: 50
      name: Peak load
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: Health check
    weight: 10
    flow:
      - get:
          url: "/api/v1/health"

  - name: Generate completion
    weight: 90
    flow:
      - post:
          url: "/api/v1/generate"
          json:
            prompt: "Say hello in one sentence."
            max_tokens: 50
            temperature: 0.7
          expect:
            - statusCode: 200